Revit 2027 API
CloudPoint.X Field
The X coordinate
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public float X
Public X As Single
public:
float X
val mutable X: float32
Field Value
Single
See Also
Reference
CloudPoint Structure
Autodesk.Revit.DB.PointClouds Namespace